app/views/cart/index.html.erb

SELECT "items".* FROM "items" INNER JOIN "products" ON "items"."id" = "products"."item_id" WHERE "products"."cart_id" = $1  [["cart_id", 1]]
---
                  <ul>
                   <% cart.items.each do |item| %>