app/controllers/items/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 100], ["comment", "Good"], ["item_id", 16], ["created_at", "2024-04-29 16:10:07.338823"], ["updated_at", "2024-04-29 16:10:07.338823"]]
---
    def create
      @review = @item.reviews.new(review_params)


  if @review.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def find_item
      @item = Item.find(params[:item_id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = $1  [["item_id", 16]]
---
    def find_review
      @review = @item.reviews.find(params[:id])