app/controllers/cart_controller.rb

    def set_current_cart
        @current_cart = current_user.carts.last
        @current_cart ||= current_user.carts.create if current_user
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 ORDER BY "carts"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at", "user_id", "is_purchased") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2024-04-29 16:04:28.962715"], ["updated_at", "2024-04-29 16:04:28.962715"], ["user_id", 1], ["is_purchased", nil]]

    def index
        @purchased_carts = current_user.carts.where(is_purchased: true)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."is_purchased" = $2  [["user_id", 1], ["is_purchased", true]]

    def show
        @cart = @current_cart
        @products = @cart.products.includes(:item)
        @total_cost = @products.sum { |product| product.item.price }
---
SELECT "products".* FROM "products" WHERE "products"."cart_id" = $1  [["cart_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1  [["id", 16]]