app/controllers/categories_controller.rb

  def show
    @categories = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]