app/controllers/favorite_controller.rb

    def show
        @favorites = @current_user.favorites.includes(:item)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]