app/controllers/hologram_controller.rb

  def index
    @holograms = Hologram.order(:price)
---
SELECT "holograms".* FROM "holograms" ORDER BY "holograms"."price" ASC