app/controllers/items_controller.rb

  def index
    if params[:search]
      @items = Item.where("name ILIKE ?", "%#{params[:search]}%").order(:price).paginate(page: params[:page], per_page: 10)
    else
      @items = Item.order(:price).paginate(page: params[:page], per_page: 8)
---
SELECT "items".* FROM "items" WHERE (name ILIKE '%figure%') ORDER BY "items"."price" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE (name LIKE '%%')
SELECT COUNT(*) FROM "items"

  def show
    @items = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_categories
    @categories = Category.all.order(:name)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC

  def set_current_cart
    @current_cart = current_user.carts.last
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 ORDER BY "carts"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def add_to_cart
    @item = Item.find(params[:id])
    @cart = @current_cart
    @products = @cart.products
    @current_cart.products.create(item: @item)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
INSERT INTO "products" ("item_id", "cart_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item_id", 16], ["cart_id", 1], ["quantity", nil], ["created_at", "2024-04-29 16:10:33.869470"], ["updated_at", "2024-04-29 16:10:33.869470"]]