app/controllers/pages_controller.rb

UPDATE "users" SET "updated_at" = $1, "has_membership" = $2, "membership_tier" = $3 WHERE "users"."id" = $4  [["updated_at", "2024-04-29 16:09:37.849917"], ["has_membership", true], ["membership_tier", "jedi"], ["id", 1]]
---
  def membership_signup
    if current_user
      if current_user.update(user_params)