app/controllers/payments_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @payment = Payment.new
    @cart = Cart.find(params[:cart_id])

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "updated_at" = $1, "is_purchased" = $2 WHERE "carts"."id" = $3  [["updated_at", "2024-04-29 16:11:01.745772"], ["is_purchased", true], ["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at", "user_id", "is_purchased") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2024-04-29 16:11:01.749396"], ["updated_at", "2024-04-29 16:11:01.749396"], ["user_id", 1], ["is_purchased", nil]]
---
  def process_payment
    card_params = params.require(:payment).permit(:card_number, :card_name, :card_expiry, :card_cvv)

    @cart = Cart.find_by(id: params[:cart_id])

    if validate_card_info(card_params)
      @cart.update(is_purchased: true)
      @current_user.carts.create